wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl876x_iso7816.h
/**
*********************************************************************************************************
*               Copyright(c) 2024, Realtek Semiconductor Corporation. All rights reserved.
*********************************************************************************************************
* \file     rtl876x_iso7816.h
* \brief    The header file of the peripheral ISO7816 driver.
* \details
* \author   qinyuan_hu
* @date     2024-06-18
* \version  v1.0
* *******************************************************************************************************
*/

/*============================================================================*
 *               Define to prevent recursive inclusion
 *============================================================================*/
#ifndef RTL876X_ISO7816_H
#define RTL876X_ISO7816_H

#ifdef __cplusplus
extern "C" {
#endif

/*============================================================================*
 *                        Header Files
 *============================================================================*/
#include "rtl876x_iso7816_def.h"

/** \defgroup 87X2G_ISO7816     ISO7816
  * \brief
  * \{
  */

/*============================================================================*
 *                         Constants
 *============================================================================*/
/** \defgroup ISO7816_Exported_Constants ISO7816 Exported Constants
  * \brief
  * \{
  */

/**
 * \defgroup    ISO7816_FIFO_SIZE ISO7816 FIFO SIZE
 * \{
 * \ingroup     ISO7816_Exported_Constants
 */
#define ISO7816_TX_FIFO_SIZE             16
#define ISO7816_RX_FIFO_SIZE             32

/** End of ISO7816_FIFO_SIZE
  * \}
  */

/**
 * \defgroup    ISO7816_Clock_Cmd ISO7816 Clock Cmd
 * \{
 * \ingroup     ISO7816_Exported_Constants
 */
#define ISO7816_CLK_CONTACT_Reset                    ISO7816_CLOCK_ENABLE_CLR
#define ISO7816_CLK_CONTACT_Set                      ISO7816_CLOCK_ENABLE_MSK

/** End of ISO7816_Clock_Cmd
  * \}
  */

/**
 * \defgroup    ISO7816_Clock_Stop_Polar ISO7816 Clock Stop Polar
 * \{
 * \ingroup     ISO7816_Exported_Constants
 */
#define ISO7816_CLOCK_STOP_POLAR_LOW                 ISO7816_CLOCK_STOP_POLAR_CLR
#define ISO7816_CLOCK_STOP_POLAR_HIGH                ISO7816_CLOCK_STOP_POLAR_MSK

/** End of ISO7816_Clock_Stop_Polar
  * \}
  */

/**
 * \defgroup    ISO7816_Power_Cmd ISO7816 Power Cmd
 * \{
 * \ingroup     ISO7816_Exported_Constants
 */
#define ISO7816_VCC_CONTACT_Reset                    ISO7816_VCC_ENABLE_CLR
#define ISO7816_VCC_CONTACT_Set                      ISO7816_VCC_ENABLE_MSK

/** End of ISO7816_Power_Cmd
  * \}
  */

/**
 * \defgroup    ISO7816_Reset_Cmd ISO7816 Reset Cmd
 * \{
 * \ingroup     ISO7816_Exported_Constants
 */
#define ISO7816_RST_CONTACT_Reset                    ISO7816_RESET_ENABLE_CLR
#define ISO7816_RST_CONTACT_Set                      ISO7816_RESET_ENABLE_MSK

/** End of ISO7816_Reset_Cmd
  * \}
  */

/**
 * \defgroup    ISO7816_Generral_Purpose_Counter_Cmd ISO7816 GP Counter Cmd
 * \{
 * \ingroup     ISO7816_Exported_Constants
 */
#define ISO7816_GP_CNT_DISABLE                       ISO7816_GP_COUNTER_ENABLE_CLR
#define ISO7816_GP_CNT_ENABLE                        ISO7816_GP_COUNTER_ENABLE_MSK

/** End of ISO7816_Generral_Purpose_Counter_Cmd
  * \}
  */

/**
 * \defgroup    ISO7816_Controller_Cmd ISO7816 Controller Cmd
 * \{
 * \ingroup     ISO7816_Exported_Constants
 */
#define ISO7816_CR_DISABLE                           ISO7816_CONTROLLER_ENBALE_CLR
#define ISO7816_CR_ENABLE                            ISO7816_CONTROLLER_ENBALE_MSK

/** End of ISO7816_Controller_Cmd
  * \}
  */

/**
 * \defgroup    ISO7816_IO_Mode ISO7816 IO Mode
 * \{
 * \ingroup     ISO7816_Exported_Constants
 */
#define ISO7816_IO_MODE_RX                           ISO7816_IO_MODE_CLR
#define ISO7816_IO_MODE_TX                           ISO7816_IO_MODE_MSK

/** End of ISO7816_IO_Mode
  * \}
  */

/**
 * \defgroup    ISO7816_Coding_Convention_Cmd ISO7816 Coding Convention Cmd
 * \{
 * \ingroup     ISO7816_Exported_Constants
 */
#define ISO7816_CODING_CONVENTION_DIRECT             ISO7816_CODING_CONVENTION_CLR
#define ISO7816_CODING_CONVENTION_INVERSE            ISO7816_CODING_CONVENTION_MSK

/** End of ISO7816_Coding_Convention_Cmd
  * \}
  */

/**
 * \defgroup    ISO7816_Coding_Convention_Cmd ISO7816 Coding Convention Cmd
 * \{
 * \ingroup     ISO7816_Exported_Constants
 */
#define ISO7816_IO_STATE_SAMPLE_DISABLE              ISO7816_IO_STATE_SAMPLE_CLR
#define ISO7816_IO_STATE_SAMPLE_ENABLE               ISO7816_IO_STATE_SAMPLE_MSK

/** End of ISO7816_Coding_Convention_Cmd
  * \}
  */

/**
 * \defgroup    ISO7816_Interrupts_Definition  ISO7816 Interrupts Definition
 * \{
 * \ingroup     ISO7816_Exported_Constants
 */
#define ISO7816_INT_RESET_TIMING_VIOLATION           ((uint16_t)(1 << 0))
#define ISO7816_INT_TX_NAK_THD                       ((uint16_t)(1 << 1))
#define ISO7816_INT_CHAR_WAIT_TIMEOUT                ((uint16_t)(1 << 2))
#define ISO7816_INT_GP_COUNTER                       ((uint16_t)(1 << 3))
#define ISO7816_INT_TX_FIFO_EMPTY                    ((uint16_t)(1 << 4))
#define ISO7816_INT_TX_FIFO_NOT_FULL                 ((uint16_t)(1 << 5))
#define ISO7816_INT_TX_FIFO_OVERFLOW                 ((uint16_t)(1 << 6))
#define ISO7816_INT_RX_FIFO_NOT_EMPTY                ((uint16_t)(1 << 7))
#define ISO7816_INT_RX_FIFO_ALMOST_FULL              ((uint16_t)(1 << 8))
#define ISO7816_INT_RX_FIFO_FULL                     ((uint16_t)(1 << 9))
#define ISO7816_INT_RX_FIFO_OVERFLOW                 ((uint16_t)(1 << 10))
#define ISO7816_INT_RX_FIFO_UNDERFLOW                ((uint16_t)(1 << 11))
#define ISO7816_INT_TX_DONE                          ((uint16_t)(1 << 12))

/** End of ISO7816_Interrupts_Definition
  * \}
  */

#define IS_ISO7816_INT(INT) (((INT) == ISO7816_INT_RESET_TIMING_VIOLATION) || ((INT) == ISO7816_INT_TX_NAK_THD)\
                             || ((INT) == ISO7816_INT_CHAR_WAIT_TIMEOUT) || ((INT) == ISO7816_INT_GP_COUNTER)\
                             || ((INT) == ISO7816_INT_TX_FIFO_EMPTY) || ((INT) == ISO7816_INT_TX_FIFO_NOT_FULL)\
                             || ((INT) == ISO7816_INT_TX_FIFO_OVERFLOW) || ((INT) == ISO7816_INT_RX_FIFO_NOT_EMPTY)\
                             || ((INT) == ISO7816_INT_RX_FIFO_ALMOST_FULL) || ((INT) == ISO7816_INT_RX_FIFO_FULL)\
                             || ((INT) == ISO7816_INT_RX_FIFO_OVERFLOW) || ((INT) == ISO7816_INT_RX_FIFO_UNDERFLOW)\
                             || ((INT) == ISO7816_INT_TX_DONE))

/**
 * \defgroup    ISO7816_Flags_Definition ISO7816 Flags Definition
 * \{
 * \ingroup     ISO7816_Exported_Constants
 */
#define ISO7816_FLAG_TX_FIFO_EMPTY                   ((uint16_t)(1 << 0))
#define ISO7816_FLAG_TX_FIFO_NOT_FULL                ((uint16_t)(1 << 1))
#define ISO7816_FLAG_TX_IDLE                         ((uint16_t)(1 << 2))
#define ISO7816_FLAG_RX_FIFO_NOT_EMPTY               ((uint16_t)(1 << 4))
#define ISO7816_FLAG_RX_FIFO_ALMOST_FULL             ((uint16_t)(1 << 5))
#define ISO7816_FLAG_RX_FIFO_FULL                    ((uint16_t)(1 << 6))
#define ISO7816_FLAG_RX_IO_HIGH_TIMING_VIOLATION     ((uint16_t)(1 << 8))
#define ISO7816_FLAG_RX_ATR_TIMING_VIOLATION         ((uint16_t)(1 << 9))
#define ISO7816_FLAG_TX_NAK_CNT_THD                  ((uint16_t)(1 << 10))
#define ISO7816_FLAG_RX_NAK_CNT_THD                  ((uint16_t)(1 << 11))
#define ISO7816_FLAG_TX_FIFO_OVERFLOW                ((uint16_t)(1 << 12))
#define ISO7816_FLAG_RX_FIFO_OVERFLOW                ((uint16_t)(1 << 13))
#define ISO7816_FLAG_RX_FIFO_UNDERFLOW               ((uint16_t)(1 << 14))
#define ISO7816_FLAG_RX_PARITY_ERR                   ((uint16_t)(1 << 15))

/** End of ISO7816_Flags_Definition
  * \}
  */

